<p style="font-size:30px; text-align:center; line-height:120%">
<br>
COMS W 4111-02, H02, V02<br>
Introduction to Databases<br>
Spring 2019 Take Home Midterm
</p>

# Exam Overview and Instructions

- Homework assignments and exams have point values. Final grade depends on total point value. The range of total possible points for a semester is 0 to 100 points (not including extra-credit).
    - The grade for this midterm is in the range 0 to 100.
    - __This midterm exam is worth 20 points__ for your final semester points total. So, divide your score on this exam by 5 to determine point contribution.


- Submission:
    - The exam is due on 27-Oct-2019 at 11:59PM. __You may not use grace days.__
    - Submission:
        - Submission format a copy of this Jupyter Notebook with your solutions entered into the code cells or Markdown cells for each question. If you embed images or diagrams, you may need to use a zip file to include the images in the notebook.
        - You submit your homework on CourseWorks under "Midterm Examination" assignment.
        - No other formats are allowed.
        - If the notebook format is incorrect or the notebook is corrupted, the grade is 0.
        - Submissions after the due date and time are not allowed. Submissions not received on time receive a grade of 0.
    - Respect for the individual is paramount. We will accommodate special circumstances, but we must be notified and discuss __in advance.__
    

- Exam Rules:
    - Please read and review the [Academic Integrity policy and guidelines](https://www.college.columbia.edu/academics/academicintegrity), including subsections and details. This material defines the rules for this exam regardless of your school.
    - No collaboration of any form is permitted. You may not share material of any form, including links to on-line information, __information from the preparatory recitation section,__ suggestions or ideas, etc.
    - You __MAY__ use material from office hours or recitations.
    - You MAY use any on-line information you find, but may not directly use code you find. You must cite any on-line sources in the comments Markdown cell for each questions.
    - You must privately send comments or questions to Professor Ferguson via email. If questions or comments demonstrate a need for clarification or correction, Prof. Ferguson will update this document and send an email notification.
    - You may not discuss the exam on Piazza. The CA or professor may post clarifying comment on Piazza.

- Completing the exam:
    - Environment:
        - You must install [iPython-SQL](https://github.com/catherinedevlin/ipython-sql). Lecture notebooks have included iPython-SQL since lecture 1. There are installation instructions on the iPython-SQL web site and in lecture notes. __Note:__ You must install into your Anaconda environment, and not other system Python environments.
        - You will need to use several databases/schemas for the homework. You will need to use lahman2019clean, which you had to install for HW2. You will also need [classicmodels](http://www.mysqltutorial.org/mysql-sample-database.aspx). You need to install both databases, if you have not. You MUST use the schema/database names lahman2019clean and classmodels.
        - You must have a user ID dbuser with password dbuserdbuser and use in any connections you make completing questions.
        - Section 2 tests the setup of your environment. You __MUST USE__  dbuser:dbuserdbuser@localhost/lahman2019. 
        - Your database __MUST HAVE__ a user ```dbuser``` with pasword ```dbuserdbuser```
    - Each question starts with an explanation of the structure of the answer, e.g. prose, diagram, SQL, etc.
    - Questions requiring SQL or code have empty text cells where you enter your statements. Some also contain sample answers to help you determine if your answer is correct. You must show the execution of your SQL in your submission. You may use LIMIT 10 to reduce the size of results.

You may include diagrams in text/Markdown cells when answering a question. You can include a diagram using an HTML tag of the form:<br><br>

```<img src="./filename.file_extension">```

<br>
The example below between the horizontal lines includes an image. You can click on the cell to see the Markdown code for including the image. <b>You will have to submit a zip file containing the notebook and you image if you include diagrams or images in your submission.</b>
<br><br>

<hr style="height:2px;">

- Double click in between lines to see the Markdown example for including a diagram.
<br><br>
<img src="./Columbia_University_logo.jpg">
<br><br>
<hr style="height:2px;">

<span style="font-size:24px; color:red; line-height:1.2;">Note:</span>

- <span style="color:red;">Not all questions with the same point value are equally hard. </span>


- <span style="color:red;">One five point question might be much easier than another five point question.</span>


- <span style="color:red;">A ten point question is not always exactly twice as hard as a five point question.</span>


- <span style="color:red;">Students sometimes complain about the discrepancy in difficulty and value.</span>


- <span style="color:red;">I am sensitive to the concern. I am happy to resolve this complaint by redoing the exam to make all five point questions as hard as the hardest five point question, and all ten point questions as hard as the hardest ten point question.</span>


- <span style="color:red;">Just let me know.</span>

# Environment Test

This section tests the environment. You must change the "userid:pw" to the correct user ID and password for your MySQL instance. Please change back to "userid:pw" before submitting your exam. Unless you have received an exception, you __MUST USE dbuser:dbuserdbuser.__

## SQL Magic Plugin

In [1]:
%load_ext sql
%sql mysql+pymysql://dbuser:dbuserdbuser@localhost/lahman2019clean
        
%sql select * from people where playerid='willite01'

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
1 rows affected.

[('willite01', '1918', '8', '30', 'USA', 'CA', 'San Diego', '2002', '7', '5', 'USA', 'FL', 'Inverness', 'Ted', 'Williams', 'Theodore Samuel', 205, '75', 'L', 'R', '1939-04-20', '1960-09-28', 'willt103', 'willite01', datetime.datetime(1918, 8, 30, 0, 0), datetime.datetime(2002, 7, 5, 0, 0))]

In [2]:
%sql select * from classicmodels.customers where customerNumber=103

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
1 rows affected.

[(103, 'Atelier graphique', 'Schmitt', 'Carine ', '40.32.2555', '54, rue Royale', None, 'Nantes', None, '44000', 'France', 1370, Decimal('21000.00'))]

## Python Connection

In [3]:
import json
import pymysql
import logging

logging.basicConfig(level=logging.DEBUG)
logger = logging.getLogger()
logger.setLevel(logging.DEBUG)

midterm_conn = pymysql.connect(
    host="localhost",
    user="dbuser",
    password="dbuserdbuser",
    cursorclass=pymysql.cursors.DictCursor)

In [4]:
import logging


def run_q(sql, args=None, fetch=True, cur=None, conn=midterm_conn, commit=True):
    '''
    Helper function to run an SQL statement.

    This is a modification that better supports HW1. An RDBDataTable MUST have a connection specified by
    the connection information. This means that this implementation of run_q MUST NOT try to obtain
    a defailt connection.

    :param sql: SQL template with placeholders for parameters. Canno be NULL.
    :param args: Values to pass with statement. May be null.
    :param fetch: Execute a fetch and return data if TRUE.
    :param conn: The database connection to use. This cannot be NULL, unless a cursor is passed.
        DO NOT PASS CURSORS for HW1.
    :param cur: The cursor to use. This is wizard stuff. Do not worry about it for now.
        DO NOT PASS CURSORS for HW1.
    :param commit: This is wizard stuff. Do not worry about it.

    :return: A pair of the form (execute response, fetched data). There will only be fetched data if
        the fetch parameter is True. 'execute response' is the return from the connection.execute, which
        is typically the number of rows effected.
    '''

    cursor_created = False
    connection_created = False

    try:

        if conn is None:
            raise ValueError("In this implementation, conn cannot be None.")

        if cur is None:
            cursor_created = True
            cur = conn.cursor()

        if args is not None:
            log_message = cur.mogrify(sql, args)
        else:
            log_message = sql

        logger.debug("Executing SQL = " + log_message)

        res = cur.execute(sql, args)

        if fetch:
            data = cur.fetchall()
        else:
            data = None

        # Do not ask.
        if commit == True:
            conn.commit()

    except Exception as e:
        raise(e)

    return (res, data)

In [5]:
q = "select playerID, nameLast, nameFirst from lahman2019clean.people where nameLast=%s and birthCity=%s"
res,d = run_q(q, args=('Williams', 'San Diego'))

print("Data = ", json.dumps(d, indent=2))

DEBUG:root:Executing SQL = select playerID, nameLast, nameFirst from lahman2019clean.people where nameLast='Williams' and birthCity='San Diego'

Data =  [
  {
    "playerID": "willite01",
    "nameLast": "Williams",
    "nameFirst": "Ted"
  },
  {
    "playerID": "willitr01",
    "nameLast": "Williams",
    "nameFirst": "Trevor"
  }
]

# Written Questions

Each question is worth 5 points.

## Benefits of Database Management Systems

- Prior to database management systems (DBMS), user relied on application programs that directly access files to create, retrieve and update shared data.


- Give five benefits of using a database management system to provide data access for applications.


- One or two sentences is sufficient for each answer.


- Double click on the number to open the Markdown cell.

<u>Answer</u>

1.Reduce Data Redundancy. A database management system prevent unnecessary duplicate data being scattered in different places, so it's easier to manage them

2.Sharing of Data. A database management system allows the users to share data among themselves which enables better collaboration and data control.

3.Data Security. By making sure only authorized user is allowed to access/modify certain data, DBMS greatly reduces the chance of data leaking.

4.Data Integrity. Data integrity ensures the data is accurate and consistent (the data is constructed with constraints) within the database, which prevent the date from being corrupted

5.Data Independence. Usually the DBMS is maintained seperately from the application, which allows the developer to modify the database without affecting the application.

## Relational Concepts

Briefly explain _Cartesian product, equijoin, natural join,_ and _theta join._

<u>Answer</u>

<b>Cartesian product</b>, denoted as: $A \times B$. It construct the result out of each possible ordered pairs of tuples from the two tables. (if table A has n rows, B has m rows, the result cartesian product of two tables contain $m \times n$ rows)\
<b>Equijoin</b> correspond to the SQL queries of the format: "SELECT * FROM table1 JOIN table2 ON condition", or it can be denoted as $ \sigma_{condition}(table1 \times table2) $ (condition has the form a=b, c=d,...). The result is constructed by combining rows from two tables that have equivalent values for the specified columns (rows don't share equivalent values are discarded by default). If two tables contains the columns with same names, they are renamed and repeated in the result table.\
<b>Natural join</b> correspond to the SQL queries of the format: "SELECT * FROM table1 NATURAL JOIN table2". Natural join is like equijoin that works on the columns with the same name between two tables. It works by returning rows with the equivalent values for identically named columns between two tables. But repeated columns with the same name will appear once only.\
<b>Theta Join</b>, denoted as: $ r \bowtie_{\theta} s = \sigma_{\theta}(r \times s)$. It is like equijoin but the condition ($\theta$) can be many other operators other than equity.

## Relational Algebra

Use the following tables when answering this question.

| Name    | Month |
|--------|-----------|
| Don | September |
| Meghna | June      |
| Aly    | January   |
| Ara    | September |
| Kirit  | May       |
|| __BirthInfo__ |



| Month | Sign |
|-----------|-----------|
| January   | Acquarius |
| September | Virgo     |
| June      | Gemini    |
| July      | Leo       |
|| __AstrologicalInfo__ |


Give the result of each of the relational algebra statements. You can provide your answer in text in the form:
<br><br>
column name, column name, ..., column name<br>
value, value, ..., value<br>
value, value, ..., value<br>
value, value, ..., value<br>

<span style="font-size:20px;">1. $\sigma_{Month="September"}(BirthInfo)\ \bowtie \ \pi_{Sign}(\sigma_{Month<"September"}(AstrologicalInfo))$</span>
<br><br>
<u>Answer</u>

Name, Month, Sign\
Don, September, Acquarius\
Don, September, Gemini\
Don, September, Leo\
Ara, September, Acquarius\
Ara, September, Gemini\
Ara, September, Leo

<span style="font-size:20px;">2. $\pi_{Name}(\sigma_{Month="December"}(AstrologicalSign))$</span>
<br><br>
<u>Answer</u>

Name

<span style="font-size:20px;">3. $BirthInfo \  \bowtie_{BirthInfo.Month=AstrologicalSign.Month} \ AstrologicalInfo $</span>
<br><br>
<u>Answer</u>

Name, BirthInfo.Month, AstrologicalSign.Month, Sign\
Don, September, September, Virgo\
Meghna, June, June, Gemini\
Aly, January, January, Acquarius\
Ara, September, September, Virgo

<span style="font-size:20px;">4. $\pi_{Month}(BirthInfo) \land   \pi_{Month}(AstrologicalInfo) $</span>
<br><br>
<u>Answer</u>

Month\
September\
June\
January

<span style="font-size:20px;">5. Produce an SQL statement that is equivalent to $Student( \underline{UNI}, last_name, first_name, email)$</span>
<br><br>
<u>Answer</u>

```sql
CREATE TABLE `Student` (
    `UNI` varchar(8) NOT NULL,
    `lastname` varchar(64) NOT NULL,
    `firstname` varchar(64) NOT NULL,
    `email` text NOT NULL,
    PRIMARY KEY (`UNI`)
);
```

## Relational Semantics

Provide a short (at most five sentences) answer to the following questions.

```1.``` __Codd's Twelve Rules__ define what it means for a DBMS to be relational. Briefly explain Rule 3, "Systematic treatment of null values."

<u>Answer</u>

NULL value is distinct from 0 or empty characters or string of empty characters in RBMS. NULL can be used to represent unknown data, not applicable data, or empty data, and it should be treated differently, independently from all other data types.

```2.``` In a relational model, the domain for an attribute must be _atomic._ Briefly explain what this means. Given an example of a domain that is not atomic.

<u>Answer</u>

According to Codd, for an attribute to be atomic means it cannot be divided further, or "each attribute in each tuple within a relation should consist of a single value and not allow multivalued structures", or if the attribute has component parts, the RDBS either ignores those parts or provide manipulation for those parts.\
For example, if a domain that is an array that can be extended, the domain is not atomic.\
Reference: https://dba.stackexchange.com/questions/2342/what-is-atomic-relation-in-first-normal-form

```3.``` Briefly explain _super key, candidate key,_ and _primary key._

<u>Answer</u>

Suppose $ R $ is our relation and $ K $ is the key where $ K \subseteq R $.\
If values for $ K $ are sufficient for uniquely specify all possible tuples in our relation $ R $, $ K $ is a <b>super key</b> of $ R $.\
If a super key is minimal (contains the least number of attributes), it's called a <b>candidate key</b>.\
<b>Primary key</b> is a candidate key subjectively chosen as the "best key" for uniquely identifying the tuples.

```4.``` Briefly (two or three sentences) explain the following concepts: _domain constraint, table integrity constraints, referential integrity constraints._

<u>Answer</u>

<b>Domain constraint</b> is essentially a data type constraints with optional checks (like range of the value). It limit the data type for attributes. For example building number must be integers, if we try to insert a row with float building number value, it would violate the domain constraint.\
<b>Table integrity constraints</b> make sure that authorized changes to the database (table) does not result in a loss of data consistency. Like the user ID must be unique, this constraint guarantees that new insertions won't result in a duplicate user ID.\
<b>Referential integrity constraints</b> ensures that a value that appears in one relation for a given set of attributes also appears for a certain set of attributes in another relation. Like if a resident lives in a certain building in one table, then the building must also exist in some other tables.

```5.``` What are referential integrity _cascading deletes_ and _cascading updates?_

<u>Answer</u>

When a referential integrity is violated (like we delete a building without modifying its residents), the normal procedure is to reject the operation that violated the integrity.\
Cascading delete means if a record in the parent table (referenced table) is deleted, then the corresponding records in the child table will automatically be deleted.\
Like cascading delete, cascading update means if a record in the parent table (referenced table) is updated, then the corresponding records in the child table will automatically be updated.

# SQL Data Manipulation Language Questions

##  Batter Performance for Red Sox in 1960 (5 points)

- This query requires the following columns from ```Lahman2019clean:```
    - ```people.playerid, people.nameLast, people.bats```
    - ```batting.playerid, batting.ab, batting.h, batting.bb, batting.hr, batting.teamid, batting.yearid, batting.2b, batting.3b, batting.HR```
    
    
- The formula for on-base percentage is (H + BB)/(BB + AB). We will denote on-base percentage as ```OBP.```


- Batting average is H/AB. We will denote this as AVG.


- Slugging Percentage:
    - In the ```Batting``` table, ```H``` is total hits.
    - The table lists three types of hits ```2B`` is doubles, ```3B``` is triples and ```HR``` is homeruns.
    There is a fourth type of hit, _singles_ that contributes to total hits but is not in the table. We will call this ```1B```
    - The formulate for slugging percentage, which we will denote as SLG, is<br><br>
\begin{equation}
\frac{1B + 2*2B + 3*3B + 4*HR}{AB}
\end{equation}


- The following table summarizes batting performance for BOS in 1960 for the top ten hitters, ordered by SLG. Write and execute the SQL to produce the table.

<u>Your query and execution</u>

In [6]:
%%sql 
SELECT people.playerID AS playerid, nameLast, bats, H, AB, (H - 2B - 3B - HR)AS 1B, 2B, 3B, HR, RBI, 
ROUND((H / AB), 3) AS AVG, ROUND(((H + BB)/(BB + AB)), 3) AS OBP, 
ROUND((((H - 2B - 3B - HR) + 2*2B + 3*3B + 4*HR) / AB), 3) AS SLG
FROM people JOIN batting ON batting.playerID = people.playerID
WHERE yearID = 1960 AND teamID = "BOS"
ORDER BY SLG DESC 
LIMIT 10

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
10 rows affected.

/Users/derek/anaconda3/lib/python3.7/site-packages/pymysql/cursors.py:170: Warning: (1365, 'Division by 0')
  result = self._query(query)

[('willite01', 'Williams', 'L', '98', '310', 54.0, '15', '0', '29', '72', 0.316, 0.449, 0.645),
 ('pagliji01', 'Pagliaroni', 'R', '19', '62', 10.0, '5', '2', '2', '9', 0.306, 0.427, 0.548),
 ('geigega01', 'Geiger', 'L', '74', '245', 49.0, '13', '3', '9', '33', 0.302, 0.362, 0.49),
 ('wertzvi01', 'Wertz', 'L', '125', '443', 84.0, '22', '0', '19', '103', 0.282, 0.338, 0.46),
 ('thomsbo01', 'Thomson', 'R', '30', '114', 21.0, '3', '1', '5', '20', 0.263, 0.328, 0.439),
 ('nixonru01', 'Nixon', 'L', '81', '272', 56.0, '17', '3', '5', '33', 0.298, 0.33, 0.438),
 ('fornimi01', 'Fornieles', 'R', '6', '15', 6.0, '0', '0', '0', '1', 0.4, 0.4, 0.4),
 ('malzofr01', 'Malzone', 'R', '161', '595', 115.0, '30', '2', '14', '79', 0.271, 0.312, 0.398),
 ('runnepe01', 'Runnels', 'L', '169', '528', 136.0, '29', '2', '2', '35', 0.32, 0.401, 0.394),
 ('tasbywi01', 'Tasby', 'R', '108', '385', 83.0, '17', '1', '7', '37', 0.281, 0.365, 0.384)]

<u>My Answer</u>

10 rows affected.

[('willite01', 'Williams', 'L', '98', '310', 54.0, '15', '0', '29', '72', 0.316, 0.449, 0.645),
 ('pagliji01', 'Pagliaroni', 'R', '19', '62', 10.0, '5', '2', '2', '9', 0.306, 0.427, 0.548),
 ('geigega01', 'Geiger', 'L', '74', '245', 49.0, '13', '3', '9', '33', 0.302, 0.362, 0.49),
 ('wertzvi01', 'Wertz', 'L', '125', '443', 84.0, '22', '0', '19', '103', 0.282, 0.338, 0.46),
 ('thomsbo01', 'Thomson', 'R', '30', '114', 21.0, '3', '1', '5', '20', 0.263, 0.328, 0.439),
 ('nixonru01', 'Nixon', 'L', '81', '272', 56.0, '17', '3', '5', '33', 0.298, 0.33, 0.438),
 ('fornimi01', 'Fornieles', 'R', '6', '15', 6.0, '0', '0', '0', '1', 0.4, 0.4, 0.4),
 ('malzofr01', 'Malzone', 'R', '161', '595', 115.0, '30', '2', '14', '79', 0.271, 0.312, 0.398),
 ('runnepe01', 'Runnels', 'L', '169', '528', 136.0, '29', '2', '2', '35', 0.32, 0.401, 0.394),
 ('tasbywi01', 'Tasby', 'R', '108', '385', 83.0, '17', '1', '7', '37', 0.281, 0.365, 0.384)]

## Set Membership (5 points)

- This query involves the lahman2019clean tables ```halloffame, people, appearances, pitching, managers.```


- Return the ```playerID, nameLast, nameFirst``` for every person that is in all of the tables.

<u>Your query and execution</u>

In [7]:
%%sql
SELECT DISTINCT playerID as playerid, nameFirst, nameLast
FROM halloffame 
    JOIN people USING (playerID)
    JOIN appearances USING (playerID) 
    JOIN pitching USING (playerID)
    JOIN managers USING (playerID)
ORDER BY playerID DESC
LIMIT 10;

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
10 rows affected.

[('youngcy01', 'Cy', 'Young'),
 ('wrighha01', 'Harry', 'Wright'),
 ('wrighge01', 'George', 'Wright'),
 ('willite01', 'Ted', 'Williams'),
 ('whitewi01', 'Will', 'White'),
 ('whitede01', 'Deacon', 'White'),
 ('wardjo01', 'John', 'Ward'),
 ('waltebu01', 'Bucky', 'Walters'),
 ('walshed01', 'Ed', 'Walsh'),
 ('wallabo01', 'Bobby', 'Wallace')]

<u>My Answer</u>

10 rows affected.

[('zimmech01', 'Chief', 'Zimmer'),
 ('yorkru01', 'Rudy', 'York'),
 ('wilsoji01', 'Jimmie', 'Wilson'),
 ('willsma01', 'Maury', 'Wills'),
 ('willima04', 'Matt', 'Williams'),
 ('willidi02', 'Dick', 'Williams'),
 ('westrwe01', 'Wes', 'Westrum'),
 ('weisswa01', 'Walt', 'Weiss'),
 ('wathajo01', 'John', 'Wathan'),
 ('walkeha01', 'Harry', 'Walker')]

## Complex Insert (10 points)


- Use ```classicmodels``` for this question.


- An order form typically looks something like:

| <img src="./order-form-103.jpg"> |
| :---: |
| __Example Order Form__ |


- For ```classicmodels``` the application user interface would ```POST``` of the form.

```
        {
            "orderNumber": 10123,
            "orderDate": "2003-05-20",
            "requiredDate": "2003-05-29",
            "shippedDate": "2003-05-22",
            "status": "Shipped",
            "comments": null,
            "customerNumber": 103,
            "orderdetails": [
                {
                    "orderNumber": 10123,
                    "productCode": "S18_1589",
                    "quantityOrdered": 26,
                    "priceEach": "120.71",
                    "orderLineNumber": 2
                },
                {
                    "orderNumber": 10123,
                    "productCode": "S18_2870",
                    "quantityOrdered": 46,
                    "priceEach": "114.84",
                    "orderLineNumber": 3
                },
                {
                    "orderNumber": 10123,
                    "productCode": "S18_3685",
                    "quantityOrdered": 34,
                    "priceEach": "117.26",
                    "orderLineNumber": 4
                },
                {
                    "orderNumber": 10123,
                    "productCode": "S24_1628",
                    "quantityOrdered": 50,
                    "priceEach": "43.27",
                    "orderLineNumber": 1
                }
            ]
        }

```

- This data structure maps to two tables in ```classicmodels:``` ```orders``` and ```ordersdetails```


- Complete the implementation of the Python function below that takes a data structure (dict) of the form above and inserts that data into ```classicmodels.```


<u>Answer</u>

In [27]:
def create_order(order_info, cnx=midterm_conn):
    """
    Creates (Inserts) the data associated with an order. The order information goes into orders table and each
    and line item/order detail item goes into the ordersdetails table.
    :param order_info: A dictionary. There are top-level elements for the order. There is an orderdetails element
        that is a list of dictionary for the orderdetails elements.
    :param cnx: The database connection to use.
    :return: A tuple of the form (order_insert_count, orderdetals_insert_count), where the values are the number
        of rows inserted into each table.
    """
    
    # Your code goes here.
    from copy import deepcopy
    order_info = deepcopy(order_info)
    orderdetails_info = order_info.pop("orderdetails", None)
    order_number = order_info["orderNumber"]
    # Check if ordernumber already exist
    sql = "SELECT * FROM classicmodels.orders WHERE orderNumber = {}".format(order_number)
    res, _ = run_q(sql=sql)
    # if ordernumber already exist, find a new ordernumber
    if res >= 1:
        sql = "SELECT MAX(orderNumber) AS m from classicmodels.orders"
        res, data = run_q(sql=sql)
        
        new_order_number = data[0]["m"] + 1
        order_info["orderNumber"] = new_order_number
        for i in range(len(orderdetails_info)):
            orderdetails_info[i]["orderNumber"] = new_order_number
    
    def create_insert(table_name, row):
        result = "INSERT INTO classicmodels." + table_name + " "
        cols = []
        vals = []
        
        for k, v in row.items():
            cols.append(k)
            vals.append(v)
        
        col_clause = "(" + ",".join(cols) + ") "
        
        no_cols = len(cols)
        terms = ["%s"]*no_cols
        terms = ",".join(terms)
        value_clause = " values (" + terms + ")"
        
        result += col_clause + value_clause
        
        return (result, vals)
    
    order_sql, args = create_insert("orders", order_info)
    orderdetails_sql = [create_insert("orderdetails", detail) for detail in orderdetails_info]
    
    order_insert_count, _ = run_q(sql=order_sql, args=args, conn=cnx)
    orderdetails_insert_count = 0
    for sql, args in orderdetails_sql:
        count, _ = run_q(sql=sql, args=args, conn=cnx)
        orderdetails_insert_count += count
    
    return order_insert_count, orderdetails_insert_count

In [28]:
test =  {
            "orderNumber": 10123,
            "orderDate": "2003-05-20",
            "requiredDate": "2003-05-29",
            "shippedDate": "2003-05-22",
            "status": "Shipped",
            "comments": None,
            "customerNumber": 103,
            "orderdetails": [
                {
                    "orderNumber": 10123,
                    "productCode": "S18_1589",
                    "quantityOrdered": 26,
                    "priceEach": "120.71",
                    "orderLineNumber": 2
                },
                {
                    "orderNumber": 10123,
                    "productCode": "S18_2870",
                    "quantityOrdered": 46,
                    "priceEach": "114.84",
                    "orderLineNumber": 3
                },
                {
                    "orderNumber": 10123,
                    "productCode": "S18_3685",
                    "quantityOrdered": 34,
                    "priceEach": "117.26",
                    "orderLineNumber": 4
                },
                {
                    "orderNumber": 10123,
                    "productCode": "S24_1628",
                    "quantityOrdered": 50,
                    "priceEach": "43.27",
                    "orderLineNumber": 1
                }
            ]
        }

create_order(test)

DEBUG:root:Executing SQL = SELECT * FROM classicmodels.orders WHERE orderNumber = 10123
DEBUG:root:Executing SQL = SELECT MAX(orderNumber) AS m from classicmodels.orders
DEBUG:root:Executing SQL = INSERT INTO classicmodels.orders (orderNumber,orderDate,requiredDate,shippedDate,status,comments,customerNumber)  values (10426,'2003-05-20','2003-05-29','2003-05-22','Shipped',NULL,103)
DEBUG:root:Executing SQL = INSERT INTO classicmodels.orderdetails (orderNumber,productCode,quantityOrdered,priceEach,orderLineNumber)  values (10426,'S18_1589',26,'120.71',2)
DEBUG:root:Executing SQL = INSERT INTO classicmodels.orderdetails (orderNumber,productCode,quantityOrdered,priceEach,orderLineNumber)  values (10426,'S18_2870',46,'114.84',3)
DEBUG:root:Executing SQL = INSERT INTO classicmodels.orderdetails (orderNumber,productCode,quantityOrdered,priceEach,orderLineNumber)  values (10426,'S18_3685',34,'117.26',4)
DEBUG:root:Executing SQL = INSERT INTO classicmodels.orderdetails (orderNumber,productCode,quantityOrdered,priceEach,orderLineNumber)  values (10426,'S24_1628',50,'43.27',1)

(1, 4)

In [29]:
%%sql 
SELECT * FROM classicmodels.orders WHERE customerNumber = 103

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
4 rows affected.

[(10123, datetime.date(2003, 5, 20), datetime.date(2003, 5, 29), datetime.date(2003, 5, 22), 'Shipped', None, 103),
 (10298, datetime.date(2004, 9, 27), datetime.date(2004, 10, 5), datetime.date(2004, 10, 1), 'Shipped', None, 103),
 (10345, datetime.date(2004, 11, 25), datetime.date(2004, 12, 1), datetime.date(2004, 11, 26), 'Shipped', None, 103),
 (10426, datetime.date(2003, 5, 20), datetime.date(2003, 5, 29), datetime.date(2003, 5, 22), 'Shipped', None, 103)]

In [30]:
%%sql 
SELECT * FROM classicmodels.orderdetails WHERE orderNumber = 10426

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
4 rows affected.

[(10426, 'S18_1589', 26, Decimal('120.71'), 2),
 (10426, 'S18_2870', 46, Decimal('114.84'), 3),
 (10426, 'S18_3685', 34, Decimal('117.26'), 4),
 (10426, 'S24_1628', 50, Decimal('43.27'), 1)]

## Complex Query/View $-$ Player Performance Statistics by Year (10 points)

- Use the ```lahman2019clean``` database/schema.


- Create performance summary views. Create five views:
    - ```batting_summary:``` yearID, teamID, AB, H, HR, RBI
    - ```appearances summary:``` yearID, teamID, G_all, GS
    - ```pitching summary:``` yearID, teamID, W, L, IPouts
    - ```fielding_summary``` yearID, teamID, PO, A, E, POS
    - ```annual_summary,``` which combines the views above.
    - ```career_summary,``` which contains the totals/summaries for the entire career.
    
    
- __NOTE:__ You will need to do aggregation on some of the views to get annual values.


- __Note:__ Your query must produce the correct results for any ```playerID.```


<u>Answer</u>

- ```batting_summary```

```
Put your create view statement here.
```

In [31]:
%%sql
CREATE VIEW batting_summary AS
SELECT playerID, yearID, teamID, AB, H, HR, RBI 
FROM batting

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
0 rows affected.

[]

In [32]:
%sql select * from batting_summary where playerID='willite01'

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
19 rows affected.

[('willite01', '1939', 'BOS', '565', '185', '31', '145'),
 ('willite01', '1940', 'BOS', '561', '193', '23', '113'),
 ('willite01', '1941', 'BOS', '456', '185', '37', '120'),
 ('willite01', '1942', 'BOS', '522', '186', '36', '137'),
 ('willite01', '1946', 'BOS', '514', '176', '38', '123'),
 ('willite01', '1947', 'BOS', '528', '181', '32', '114'),
 ('willite01', '1948', 'BOS', '509', '188', '25', '127'),
 ('willite01', '1949', 'BOS', '566', '194', '43', '159'),
 ('willite01', '1950', 'BOS', '334', '106', '28', '97'),
 ('willite01', '1951', 'BOS', '531', '169', '30', '126'),
 ('willite01', '1952', 'BOS', '10', '4', '1', '3'),
 ('willite01', '1953', 'BOS', '91', '37', '13', '34'),
 ('willite01', '1954', 'BOS', '386', '133', '29', '89'),
 ('willite01', '1955', 'BOS', '320', '114', '28', '83'),
 ('willite01', '1956', 'BOS', '400', '138', '24', '82'),
 ('willite01', '1957', 'BOS', '420', '163', '38', '87'),
 ('willite01', '1958', 'BOS', '411', '135', '26', '85'),
 ('willite01', '1959', 'BOS', '272', '69', '10', '43'),
 ('willite01', '1960', 'BOS', '310', '98', '29', '72')]

In [10]:
%sql select * from batting_summary where playerID='willite01'

19 rows affected.

[('willite01', 'BOS', '1939', 565.0, 185.0, 31.0, 145.0),
 ('willite01', 'BOS', '1940', 561.0, 193.0, 23.0, 113.0),
 ('willite01', 'BOS', '1941', 456.0, 185.0, 37.0, 120.0),
 ('willite01', 'BOS', '1942', 522.0, 186.0, 36.0, 137.0),
 ('willite01', 'BOS', '1946', 514.0, 176.0, 38.0, 123.0),
 ('willite01', 'BOS', '1947', 528.0, 181.0, 32.0, 114.0),
 ('willite01', 'BOS', '1948', 509.0, 188.0, 25.0, 127.0),
 ('willite01', 'BOS', '1949', 566.0, 194.0, 43.0, 159.0),
 ('willite01', 'BOS', '1950', 334.0, 106.0, 28.0, 97.0),
 ('willite01', 'BOS', '1951', 531.0, 169.0, 30.0, 126.0),
 ('willite01', 'BOS', '1952', 10.0, 4.0, 1.0, 3.0),
 ('willite01', 'BOS', '1953', 91.0, 37.0, 13.0, 34.0),
 ('willite01', 'BOS', '1954', 386.0, 133.0, 29.0, 89.0),
 ('willite01', 'BOS', '1955', 320.0, 114.0, 28.0, 83.0),
 ('willite01', 'BOS', '1956', 400.0, 138.0, 24.0, 82.0),
 ('willite01', 'BOS', '1957', 420.0, 163.0, 38.0, 87.0),
 ('willite01', 'BOS', '1958', 411.0, 135.0, 26.0, 85.0),
 ('willite01', 'BOS', '1959', 272.0, 69.0, 10.0, 43.0),
 ('willite01', 'BOS', '1960', 310.0, 98.0, 29.0, 72.0)]

- ```Pitching summary```

```
Put create view statement here.
```

In [33]:
%%sql
CREATE VIEW pitching_summary AS
SELECT playerID, teamID, yearID, W as w, L as l, G as g_p, IPouts 
FROM pitching;

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
0 rows affected.

[]

In [34]:
%sql select * from pitching_summary where playerid='willite01';

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
1 rows affected.

[('willite01', 'BOS', '1940', '0', '0', '1', '6')]

In [11]:
%sql select * from pitching_summary where playerid='willite01';

1 rows affected.

[('willite01', 'BOS', '1940', 0.0, 0.0, 1.0, 6.0)]

- ```fielding summary```

```
Put create view statement here.
```

In [35]:
%%sql
CREATE VIEW fielding_summary AS
SELECT playerID, yearID, teamID, SUM(PO) AS PO, SUM(A) AS A, SUM(E) AS E, GROUP_CONCAT(DISTINCT POS) AS `group_concat(pos)`
FROM fielding
GROUP BY playerID, yearID, teamID

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
0 rows affected.

[]

In [36]:
%sql select * from fielding_summary where playerid='willite01'

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
19 rows affected.

[('willite01', '1939', 'BOS', 318.0, 11.0, 19.0, 'OF'),
 ('willite01', '1940', 'BOS', 302.0, 15.0, 13.0, 'OF,P'),
 ('willite01', '1941', 'BOS', 262.0, 11.0, 11.0, 'OF'),
 ('willite01', '1942', 'BOS', 312.0, 15.0, 4.0, 'OF'),
 ('willite01', '1946', 'BOS', 325.0, 7.0, 10.0, 'OF'),
 ('willite01', '1947', 'BOS', 347.0, 10.0, 9.0, 'OF'),
 ('willite01', '1948', 'BOS', 289.0, 9.0, 5.0, 'OF'),
 ('willite01', '1949', 'BOS', 337.0, 12.0, 6.0, 'OF'),
 ('willite01', '1950', 'BOS', 165.0, 7.0, 8.0, 'OF'),
 ('willite01', '1951', 'BOS', 315.0, 12.0, 4.0, 'OF'),
 ('willite01', '1952', 'BOS', 4.0, 0.0, 0.0, 'OF'),
 ('willite01', '1953', 'BOS', 31.0, 1.0, 1.0, 'OF'),
 ('willite01', '1954', 'BOS', 213.0, 5.0, 4.0, 'OF'),
 ('willite01', '1955', 'BOS', 170.0, 5.0, 2.0, 'OF'),
 ('willite01', '1956', 'BOS', 174.0, 7.0, 5.0, 'OF'),
 ('willite01', '1957', 'BOS', 215.0, 2.0, 1.0, 'OF'),
 ('willite01', '1958', 'BOS', 154.0, 3.0, 7.0, 'OF'),
 ('willite01', '1959', 'BOS', 94.0, 4.0, 3.0, 'OF'),
 ('willite01', '1960', 'BOS', 131.0, 6.0, 1.0, 'OF')]

In [12]:
%sql select * from fielding_summary where playerid='willite01'

19 rows affected.

[('willite01', 'BOS', '1939', 318.0, 11.0, 19.0, 'OF'),
 ('willite01', 'BOS', '1940', 302.0, 15.0, 13.0, 'OF,P'),
 ('willite01', 'BOS', '1941', 262.0, 11.0, 11.0, 'OF'),
 ('willite01', 'BOS', '1942', 312.0, 15.0, 4.0, 'OF'),
 ('willite01', 'BOS', '1946', 325.0, 7.0, 10.0, 'OF'),
 ('willite01', 'BOS', '1947', 347.0, 10.0, 9.0, 'OF'),
 ('willite01', 'BOS', '1948', 289.0, 9.0, 5.0, 'OF'),
 ('willite01', 'BOS', '1949', 337.0, 12.0, 6.0, 'OF'),
 ('willite01', 'BOS', '1950', 165.0, 7.0, 8.0, 'OF'),
 ('willite01', 'BOS', '1951', 315.0, 12.0, 4.0, 'OF'),
 ('willite01', 'BOS', '1952', 4.0, 0.0, 0.0, 'OF'),
 ('willite01', 'BOS', '1953', 31.0, 1.0, 1.0, 'OF'),
 ('willite01', 'BOS', '1954', 213.0, 5.0, 4.0, 'OF'),
 ('willite01', 'BOS', '1955', 170.0, 5.0, 2.0, 'OF'),
 ('willite01', 'BOS', '1956', 174.0, 7.0, 5.0, 'OF'),
 ('willite01', 'BOS', '1957', 215.0, 2.0, 1.0, 'OF'),
 ('willite01', 'BOS', '1958', 154.0, 3.0, 7.0, 'OF'),
 ('willite01', 'BOS', '1959', 94.0, 4.0, 3.0, 'OF'),
 ('willite01', 'BOS', '1960', 131.0, 6.0, 1.0, 'OF')]

- ```appearances_summary```

```
Put create view statement here.
```

In [37]:
%%sql
CREATE VIEW appearances_summary AS
SELECT playerID, yearID, teamID, G_all, GS
FROM appearances

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
0 rows affected.

[]

In [38]:
%sql select * from appearances_summary where playerid = 'willite01'

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
19 rows affected.

[('willite01', '1939', 'BOS', '149', '149'),
 ('willite01', '1940', 'BOS', '144', '143'),
 ('willite01', '1941', 'BOS', '143', '133'),
 ('willite01', '1942', 'BOS', '150', '150'),
 ('willite01', '1946', 'BOS', '150', '150'),
 ('willite01', '1947', 'BOS', '156', '156'),
 ('willite01', '1948', 'BOS', '137', '134'),
 ('willite01', '1949', 'BOS', '155', '155'),
 ('willite01', '1950', 'BOS', '89', '86'),
 ('willite01', '1951', 'BOS', '148', '147'),
 ('willite01', '1952', 'BOS', '6', '2'),
 ('willite01', '1953', 'BOS', '37', '26'),
 ('willite01', '1954', 'BOS', '117', '113'),
 ('willite01', '1955', 'BOS', '98', '93'),
 ('willite01', '1956', 'BOS', '136', '110'),
 ('willite01', '1957', 'BOS', '132', '125'),
 ('willite01', '1958', 'BOS', '129', '114'),
 ('willite01', '1959', 'BOS', '103', '75'),
 ('willite01', '1960', 'BOS', '113', '87')]

In [13]:
%sql select * from appearances_summary where playerid = 'willite01'

19 rows affected.

[('willite01', 'BOS', '1939', '149', '149'),
 ('willite01', 'BOS', '1940', '144', '143'),
 ('willite01', 'BOS', '1941', '143', '133'),
 ('willite01', 'BOS', '1942', '150', '150'),
 ('willite01', 'BOS', '1946', '150', '150'),
 ('willite01', 'BOS', '1947', '156', '156'),
 ('willite01', 'BOS', '1948', '137', '134'),
 ('willite01', 'BOS', '1949', '155', '155'),
 ('willite01', 'BOS', '1950', '89', '86'),
 ('willite01', 'BOS', '1951', '148', '147'),
 ('willite01', 'BOS', '1952', '6', '2'),
 ('willite01', 'BOS', '1953', '37', '26'),
 ('willite01', 'BOS', '1954', '117', '113'),
 ('willite01', 'BOS', '1955', '98', '93'),
 ('willite01', 'BOS', '1956', '136', '110'),
 ('willite01', 'BOS', '1957', '132', '125'),
 ('willite01', 'BOS', '1958', '129', '114'),
 ('willite01', 'BOS', '1959', '103', '75'),
 ('willite01', 'BOS', '1960', '113', '87')]

- ```annual_summary```

```
Put create view satement here.
```

In [39]:
%%sql
CREATE VIEW annual_summary AS
SELECT playerID, teamID, yearID, G_all, GS, AB, H, HR, RBI, w, l, g_p, IPouts, PO, A, E, `GROUP_CONCAT(POS)`
FROM batting_summary 
LEFT JOIN appearances_summary USING(playerID, teamID, yearID)
LEFT JOIN pitching_summary USING(playerID, teamID, yearID)
LEFT JOIN fielding_summary USING(playerID, teamID, yearID)

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
0 rows affected.

[]

In [40]:
%sql select * from annual_summary where playerid='willite01'

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
19 rows affected.

[('willite01', 'BOS', '1939', '149', '149', '565', '185', '31', '145', None, None, None, None, 318.0, 11.0, 19.0, 'OF'),
 ('willite01', 'BOS', '1940', '144', '143', '561', '193', '23', '113', '0', '0', '1', '6', 302.0, 15.0, 13.0, 'OF,P'),
 ('willite01', 'BOS', '1941', '143', '133', '456', '185', '37', '120', None, None, None, None, 262.0, 11.0, 11.0, 'OF'),
 ('willite01', 'BOS', '1942', '150', '150', '522', '186', '36', '137', None, None, None, None, 312.0, 15.0, 4.0, 'OF'),
 ('willite01', 'BOS', '1946', '150', '150', '514', '176', '38', '123', None, None, None, None, 325.0, 7.0, 10.0, 'OF'),
 ('willite01', 'BOS', '1947', '156', '156', '528', '181', '32', '114', None, None, None, None, 347.0, 10.0, 9.0, 'OF'),
 ('willite01', 'BOS', '1948', '137', '134', '509', '188', '25', '127', None, None, None, None, 289.0, 9.0, 5.0, 'OF'),
 ('willite01', 'BOS', '1949', '155', '155', '566', '194', '43', '159', None, None, None, None, 337.0, 12.0, 6.0, 'OF'),
 ('willite01', 'BOS', '1950', '89', '86', '334', '106', '28', '97', None, None, None, None, 165.0, 7.0, 8.0, 'OF'),
 ('willite01', 'BOS', '1951', '148', '147', '531', '169', '30', '126', None, None, None, None, 315.0, 12.0, 4.0, 'OF'),
 ('willite01', 'BOS', '1952', '6', '2', '10', '4', '1', '3', None, None, None, None, 4.0, 0.0, 0.0, 'OF'),
 ('willite01', 'BOS', '1953', '37', '26', '91', '37', '13', '34', None, None, None, None, 31.0, 1.0, 1.0, 'OF'),
 ('willite01', 'BOS', '1954', '117', '113', '386', '133', '29', '89', None, None, None, None, 213.0, 5.0, 4.0, 'OF'),
 ('willite01', 'BOS', '1955', '98', '93', '320', '114', '28', '83', None, None, None, None, 170.0, 5.0, 2.0, 'OF'),
 ('willite01', 'BOS', '1956', '136', '110', '400', '138', '24', '82', None, None, None, None, 174.0, 7.0, 5.0, 'OF'),
 ('willite01', 'BOS', '1957', '132', '125', '420', '163', '38', '87', None, None, None, None, 215.0, 2.0, 1.0, 'OF'),
 ('willite01', 'BOS', '1958', '129', '114', '411', '135', '26', '85', None, None, None, None, 154.0, 3.0, 7.0, 'OF'),
 ('willite01', 'BOS', '1959', '103', '75', '272', '69', '10', '43', None, None, None, None, 94.0, 4.0, 3.0, 'OF'),
 ('willite01', 'BOS', '1960', '113', '87', '310', '98', '29', '72', None, None, None, None, 131.0, 6.0, 1.0, 'OF')]

In [14]:
%sql select * from annual_summary where playerid='willite01'

19 rows affected.

[('willite01', 'BOS', '1939', '149', '149', 565.0, 185.0, 31.0, 145.0, None, None, None, None, 318.0, 11.0, 19.0, 'OF'),
 ('willite01', 'BOS', '1940', '144', '143', 561.0, 193.0, 23.0, 113.0, 0.0, 0.0, 1.0, 6.0, 302.0, 15.0, 13.0, 'OF,P'),
 ('willite01', 'BOS', '1941', '143', '133', 456.0, 185.0, 37.0, 120.0, None, None, None, None, 262.0, 11.0, 11.0, 'OF'),
 ('willite01', 'BOS', '1942', '150', '150', 522.0, 186.0, 36.0, 137.0, None, None, None, None, 312.0, 15.0, 4.0, 'OF'),
 ('willite01', 'BOS', '1946', '150', '150', 514.0, 176.0, 38.0, 123.0, None, None, None, None, 325.0, 7.0, 10.0, 'OF'),
 ('willite01', 'BOS', '1947', '156', '156', 528.0, 181.0, 32.0, 114.0, None, None, None, None, 347.0, 10.0, 9.0, 'OF'),
 ('willite01', 'BOS', '1948', '137', '134', 509.0, 188.0, 25.0, 127.0, None, None, None, None, 289.0, 9.0, 5.0, 'OF'),
 ('willite01', 'BOS', '1949', '155', '155', 566.0, 194.0, 43.0, 159.0, None, None, None, None, 337.0, 12.0, 6.0, 'OF'),
 ('willite01', 'BOS', '1950', '89', '86', 334.0, 106.0, 28.0, 97.0, None, None, None, None, 165.0, 7.0, 8.0, 'OF'),
 ('willite01', 'BOS', '1951', '148', '147', 531.0, 169.0, 30.0, 126.0, None, None, None, None, 315.0, 12.0, 4.0, 'OF'),
 ('willite01', 'BOS', '1952', '6', '2', 10.0, 4.0, 1.0, 3.0, None, None, None, None, 4.0, 0.0, 0.0, 'OF'),
 ('willite01', 'BOS', '1953', '37', '26', 91.0, 37.0, 13.0, 34.0, None, None, None, None, 31.0, 1.0, 1.0, 'OF'),
 ('willite01', 'BOS', '1954', '117', '113', 386.0, 133.0, 29.0, 89.0, None, None, None, None, 213.0, 5.0, 4.0, 'OF'),
 ('willite01', 'BOS', '1955', '98', '93', 320.0, 114.0, 28.0, 83.0, None, None, None, None, 170.0, 5.0, 2.0, 'OF'),
 ('willite01', 'BOS', '1956', '136', '110', 400.0, 138.0, 24.0, 82.0, None, None, None, None, 174.0, 7.0, 5.0, 'OF'),
 ('willite01', 'BOS', '1957', '132', '125', 420.0, 163.0, 38.0, 87.0, None, None, None, None, 215.0, 2.0, 1.0, 'OF'),
 ('willite01', 'BOS', '1958', '129', '114', 411.0, 135.0, 26.0, 85.0, None, None, None, None, 154.0, 3.0, 7.0, 'OF'),
 ('willite01', 'BOS', '1959', '103', '75', 272.0, 69.0, 10.0, 43.0, None, None, None, None, 94.0, 4.0, 3.0, 'OF'),
 ('willite01', 'BOS', '1960', '113', '87', 310.0, 98.0, 29.0, 72.0, None, None, None, None, 131.0, 6.0, 1.0, 'OF')]

- ```career_summary```

```
Put create view statement here.
```

In [41]:
%%sql
CREATE VIEW career_summary AS
SELECT playerID, SUM(G_all) AS G_all, SUM(GS) AS GS, SUM(AB) AS AB, SUM(H) AS H, SUM(HR) AS HR, 
SUM(RBI) AS RBI, SUM(w) AS w, SUM(l) AS l, SUM(IPouts) AS IPouts, SUM(PO) AS PO, SUM(A) AS A, SUM(E) AS E, 
p.positions AS positions
FROM annual_summary LEFT JOIN (
    SELECT playerID, GROUP_CONCAT(DISTINCT POS) AS positions
    FROM fielding
    GROUP BY playerID
) AS p USING(playerID)
GROUP BY playerID

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
0 rows affected.

[]

In [42]:
%sql select * from career_summary limit 10;

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
10 rows affected.

[('aardsda01', 331.0, 0.0, 4.0, 0.0, 0.0, 0.0, 16.0, 18.0, 1011.0, 11.0, 29.0, 3.0, 'P'),
 ('aaronha01', 3298.0, 3173.0, 12364.0, 3771.0, 755.0, 2297.0, None, None, None, 7436.0, 429.0, 144.0, '1B,2B,3B,OF'),
 ('aaronto01', 437.0, 206.0, 944.0, 216.0, 13.0, 94.0, None, None, None, 1317.0, 113.0, 22.0, '1B,2B,3B,OF'),
 ('aasedo01', 448.0, 91.0, 5.0, 0.0, 0.0, 0.0, 66.0, 60.0, 3328.0, 67.0, 135.0, 13.0, 'P'),
 ('abadan01', 15.0, 4.0, 21.0, 2.0, 0.0, 0.0, None, None, None, 37.0, 1.0, 1.0, '1B,OF'),
 ('abadfe01', 363.0, 6.0, 9.0, 1.0, 0.0, 0.0, 8.0, 27.0, 953.0, 7.0, 37.0, 2.0, 'P'),
 ('abadijo01', 12.0, 0.0, 49.0, 11.0, 0.0, 5.0, None, None, None, 129.0, 3.0, 13.0, '1B'),
 ('abbated01', 857.0, 357.0, 3044.0, 772.0, 11.0, 324.0, None, None, None, 1873.0, 2368.0, 315.0, '2B,3B,OF,SS'),
 ('abbeybe01', 79.0, 0.0, 225.0, 38.0, 0.0, 17.0, 22.0, 40.0, 1704.0, 17.0, 134.0, 22.0, 'P'),
 ('abbeych01', 452.0, 0.0, 1756.0, 493.0, 19.0, 280.0, 0.0, 0.0, 6.0, 920.0, 92.0, 100.0, 'OF,P')]

In [16]:
%sql select * from career_summary limit 10;

10 rows affected.

[('aardsda01', 331, 0, 4, 0, 0, 0, 16, 18, 1011, 11, 29, 3, 'P'),
 ('aaronha01', 3298, 3173, 12364, 3771, 755, 2297, None, None, None, 7436, 429, 144, '1B,2B,3B,OF'),
 ('aaronto01', 437, 206, 944, 216, 13, 94, None, None, None, 1317, 113, 22, '1B,2B,3B,OF'),
 ('aasedo01', 448, 91, 5, 0, 0, 0, 66, 60, 3328, 67, 135, 13, 'P'),
 ('abadan01', 15, 4, 21, 2, 0, 0, None, None, None, 37, 1, 1, '1B,OF'),
 ('abadfe01', 363, 6, 9, 1, 0, 0, 8, 27, 953, 7, 37, 2, 'P'),
 ('abadijo01', 12, 0, 49, 11, 0, 5, None, None, None, 129, 3, 13, '1B'),
 ('abbated01', 857, 357, 3044, 772, 11, 324, None, None, None, 1873, 2368, 315, '2B,3B,OF,SS'),
 ('abbeybe01', 79, 0, 225, 38, 0, 17, 22, 40, 1704, 17, 134, 22, 'P'),
 ('abbeych01', 452, 0, 1756, 493, 19, 280, 0, 0, 6, 920, 92, 100, 'OF,P')]

## Update Statement (5 points)

- Make copies of the ```orders``` table in ```classicmodels.```


- The following statements will accomplish that.

In [43]:
%%sql
use classicmodels;
drop table if exists orders_copy;
create table orders_copy as select * from orders;

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
0 rows affected.
0 rows affected.
327 rows affected.

[]

- You can test of your copy worked by producing the same results as the following query.

In [44]:
%sql select * from orders_copy join orderdetails using(orderNumber) where orderNumber=10100;

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
4 rows affected.

[(10100, datetime.date(2003, 1, 6), datetime.date(2003, 1, 13), datetime.date(2003, 1, 10), 'Shipped', None, 363, 'S18_1749', 30, Decimal('136.00'), 3),
 (10100, datetime.date(2003, 1, 6), datetime.date(2003, 1, 13), datetime.date(2003, 1, 10), 'Shipped', None, 363, 'S18_2248', 50, Decimal('55.09'), 2),
 (10100, datetime.date(2003, 1, 6), datetime.date(2003, 1, 13), datetime.date(2003, 1, 10), 'Shipped', None, 363, 'S18_4409', 22, Decimal('75.46'), 4),
 (10100, datetime.date(2003, 1, 6), datetime.date(2003, 1, 13), datetime.date(2003, 1, 10), 'Shipped', None, 363, 'S24_3969', 49, Decimal('35.29'), 1)]

In [45]:
%sql select * from orders_copy join orderdetails using(orderNumber) where orderNumber=10100;

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
4 rows affected.

[(10100, datetime.date(2003, 1, 6), datetime.date(2003, 1, 13), datetime.date(2003, 1, 10), 'Shipped', None, 363, 'S18_1749', 30, Decimal('136.00'), 3),
 (10100, datetime.date(2003, 1, 6), datetime.date(2003, 1, 13), datetime.date(2003, 1, 10), 'Shipped', None, 363, 'S18_2248', 50, Decimal('55.09'), 2),
 (10100, datetime.date(2003, 1, 6), datetime.date(2003, 1, 13), datetime.date(2003, 1, 10), 'Shipped', None, 363, 'S18_4409', 22, Decimal('75.46'), 4),
 (10100, datetime.date(2003, 1, 6), datetime.date(2003, 1, 13), datetime.date(2003, 1, 10), 'Shipped', None, 363, 'S24_3969', 49, Decimal('35.29'), 1)]

- Write a single ```UPDATE``` statement that sets the status of all orders for customers to 'EMBARGOED' if:
    - The customer's address is in Australia And
    - The order's status is not SHIPPED or CANCELLED.
    

- Before the update, run the following query. You should get results that match the example.

In [46]:
%%sql
select
	customers.customerNumber, customers.country, orders_copy.orderNumber, orders_copy.status from
    customers join orders_copy
    using (customerNumber)
    where country = 'Australia'
order by status;

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
19 rows affected.

[(471, 'Australia', 10415, 'Disputed'),
 (282, 'Australia', 10420, 'In Process'),
 (114, 'Australia', 10120, 'Shipped'),
 (114, 'Australia', 10125, 'Shipped'),
 (282, 'Australia', 10139, 'Shipped'),
 (276, 'Australia', 10148, 'Shipped'),
 (333, 'Australia', 10152, 'Shipped'),
 (276, 'Australia', 10169, 'Shipped'),
 (333, 'Australia', 10174, 'Shipped'),
 (471, 'Australia', 10193, 'Shipped'),
 (114, 'Australia', 10223, 'Shipped'),
 (471, 'Australia', 10265, 'Shipped'),
 (282, 'Australia', 10270, 'Shipped'),
 (114, 'Australia', 10342, 'Shipped'),
 (114, 'Australia', 10347, 'Shipped'),
 (282, 'Australia', 10361, 'Shipped'),
 (276, 'Australia', 10370, 'Shipped'),
 (333, 'Australia', 10374, 'Shipped'),
 (276, 'Australia', 10391, 'Shipped')]

In [61]:
%%sql
select
	customers.customerNumber, customers.country, orders_copy.orderNumber, orders_copy.status from
    customers join orders_copy
    using (customerNumber)
    where country = 'Australia'
order by status;

19 rows affected.

[(471, 'Australia', 10415, 'Disputed'),
 (282, 'Australia', 10420, 'In Process'),
 (114, 'Australia', 10120, 'Shipped'),
 (114, 'Australia', 10125, 'Shipped'),
 (282, 'Australia', 10139, 'Shipped'),
 (276, 'Australia', 10148, 'Shipped'),
 (333, 'Australia', 10152, 'Shipped'),
 (276, 'Australia', 10169, 'Shipped'),
 (333, 'Australia', 10174, 'Shipped'),
 (471, 'Australia', 10193, 'Shipped'),
 (114, 'Australia', 10223, 'Shipped'),
 (471, 'Australia', 10265, 'Shipped'),
 (282, 'Australia', 10270, 'Shipped'),
 (114, 'Australia', 10342, 'Shipped'),
 (114, 'Australia', 10347, 'Shipped'),
 (282, 'Australia', 10361, 'Shipped'),
 (276, 'Australia', 10370, 'Shipped'),
 (333, 'Australia', 10374, 'Shipped'),
 (276, 'Australia', 10391, 'Shipped')]

<u>Answer</u> Your update statement

In [47]:
%%sql
UPDATE orders_copy AS o
SET status = "EMBARGOED" 
WHERE EXISTS (
    SELECT * FROM customers AS c
    WHERE o.customerNumber = c.customerNumber
    AND c.country = "Australia"
)
AND status != "SHIPPED" AND status != "CANCELLED"

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
2 rows affected.

[]

- After running your update, run the following query to produce the same output as the example.

In [48]:
%%sql
select
	customers.customerNumber, customers.country, orders_copy.orderNumber, orders_copy.status from
    customers join orders_copy
    using (customerNumber)
    where country = 'Australia'
order by status;

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
19 rows affected.

[(471, 'Australia', 10415, 'EMBARGOED'),
 (282, 'Australia', 10420, 'EMBARGOED'),
 (114, 'Australia', 10120, 'Shipped'),
 (114, 'Australia', 10125, 'Shipped'),
 (282, 'Australia', 10139, 'Shipped'),
 (276, 'Australia', 10148, 'Shipped'),
 (333, 'Australia', 10152, 'Shipped'),
 (276, 'Australia', 10169, 'Shipped'),
 (333, 'Australia', 10174, 'Shipped'),
 (471, 'Australia', 10193, 'Shipped'),
 (114, 'Australia', 10223, 'Shipped'),
 (471, 'Australia', 10265, 'Shipped'),
 (282, 'Australia', 10270, 'Shipped'),
 (114, 'Australia', 10342, 'Shipped'),
 (114, 'Australia', 10347, 'Shipped'),
 (282, 'Australia', 10361, 'Shipped'),
 (276, 'Australia', 10370, 'Shipped'),
 (333, 'Australia', 10374, 'Shipped'),
 (276, 'Australia', 10391, 'Shipped')]

In [62]:
%%sql
select
	customers.customerNumber, customers.country, orders_copy.orderNumber, orders_copy.status from
    customers join orders_copy
    using (customerNumber)
    where country = 'Australia'
order by status;

19 rows affected.

[(471, 'Australia', 10415, 'EMBARGOED'),
 (282, 'Australia', 10420, 'EMBARGOED'),
 (114, 'Australia', 10120, 'Shipped'),
 (114, 'Australia', 10125, 'Shipped'),
 (282, 'Australia', 10139, 'Shipped'),
 (276, 'Australia', 10148, 'Shipped'),
 (333, 'Australia', 10152, 'Shipped'),
 (276, 'Australia', 10169, 'Shipped'),
 (333, 'Australia', 10174, 'Shipped'),
 (471, 'Australia', 10193, 'Shipped'),
 (114, 'Australia', 10223, 'Shipped'),
 (471, 'Australia', 10265, 'Shipped'),
 (282, 'Australia', 10270, 'Shipped'),
 (114, 'Australia', 10342, 'Shipped'),
 (114, 'Australia', 10347, 'Shipped'),
 (282, 'Australia', 10361, 'Shipped'),
 (276, 'Australia', 10370, 'Shipped'),
 (333, 'Australia', 10374, 'Shipped'),
 (276, 'Australia', 10391, 'Shipped')]

# Data Modeling, Cleanup and Implementation

## Classicmodels Orders (5 points)


- There is a glaringly obvious design problem that could compromise data integrity in the table ```classicmodels.orders.```


- The current schema is:
```
CREATE TABLE `orders` (
  `orderNumber` int(11) NOT NULL,
  `orderDate` date NOT NULL,
  `requiredDate` date NOT NULL,
  `shippedDate` date DEFAULT NULL,
  `status` varchar(15) NOT NULL,
  `comments` text,
  `customerNumber` int(11) NOT NULL,
  PRIMARY KEY (`orderNumber`),
  KEY `customerNumber` (`customerNumber`),
  CONSTRAINT `orders_ibfk_1` FOREIGN KEY (`customerNumber`) REFERENCES `customers` (`customerNumber`)
) ENGINE=InnoDB DEFAULT CHARSET=latin1;
```


- Alter the schema to correct the issue, and test your correction.

<u>Answer</u>

There should be some additional domain constraints on the status attribute. The status should be a pre-defined finite set of all possible order status (like a enum). Simply `varchar(15) NOT NULL` implies too many possible states.\
The correct create schema should be
```sql
CREATE TABLE `orders` (
  `orderNumber` int(11) NOT NULL,
  `orderDate` date NOT NULL,
  `requiredDate` date NOT NULL,
  `shippedDate` date DEFAULT NULL,
  `status` ENUM('Shipped', 'Resolved', 'Cancelled', 'On Hold', 'Disputed', 'In Process', 'Embargoed') NOT NULL,
  `comments` text,
  `customerNumber` int(11) NOT NULL,
  PRIMARY KEY (`orderNumber`),
  KEY `customerNumber` (`customerNumber`),
  CONSTRAINT `orders_ibfk_1` FOREIGN KEY (`customerNumber`) REFERENCES `customers` (`customerNumber`)
) ENGINE=InnoDB DEFAULT CHARSET=latin1;
```
Below is the sql to modify the current table

In [49]:
%%sql
ALTER TABLE orders
MODIFY COLUMN status ENUM('Shipped', 'Resolved', 'Cancelled', 'On Hold', 'Disputed', 'In Process', 'Embargoed') NOT NULL;

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
327 rows affected.

[]

In [50]:
%%sql
DESC orders

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
7 rows affected.

[('orderNumber', 'int(11)', 'NO', 'PRI', None, ''),
 ('orderDate', 'date', 'NO', '', None, ''),
 ('requiredDate', 'date', 'NO', '', None, ''),
 ('shippedDate', 'date', 'YES', '', None, ''),
 ('status', "enum('Shipped','Resolved','Cancelled','On Hold','Disputed','In Process','Embargoed')", 'NO', '', None, ''),
 ('comments', 'text', 'YES', '', None, ''),
 ('customerNumber', 'int(11)', 'NO', 'MUL', None, '')]

## Data Cleanup (10 Points)

- There are international standards for two letter country codes, e.g. ISO 3166-1.


- datahub.io has [down-loadable versions](https://datahub.io/core/country-list) of the information.


- The first part of answering this question is downloading the country code, country name information, and loading into a table in classicmodels.


- After a successful load, a sample query produces.

In [57]:
%sql SELECT * FROM classicmodels.countrycodes limit 10;

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
10 rows affected.

[('Afghanistan', 'AF'),
 ('land Islands', 'AX'),
 ('Albania', 'AL'),
 ('Algeria', 'DZ'),
 ('American Samoa', 'AS'),
 ('Andorra', 'AD'),
 ('Angola', 'AO'),
 ('Anguilla', 'AI'),
 ('Antarctica', 'AQ'),
 ('Antigua and Barbuda', 'AG')]

In [66]:
%sql SELECT * FROM classicmodels.countrycodes limit 10;

10 rows affected.

[('Afghanistan', 'AF'),
 ('land Islands', 'AX'),
 ('Albania', 'AL'),
 ('Algeria', 'DZ'),
 ('American Samoa', 'AS'),
 ('Andorra', 'AD'),
 ('Angola', 'AO'),
 ('Anguilla', 'AI'),
 ('Antarctica', 'AQ'),
 ('Antigua and Barbuda', 'AG')]

- Allowing people to enter country names as free form text is an extremely bad idea. People will enter things like 'USA,' 'US', 'U.S. of A.', 'United States,' ...


- We are going to modify a copy of ```classicmodels.customers``` to have better integrity.


- The first step is to create a copy of ```classicmodels.customers.```

In [58]:
%sql create table classicmodels.customers_clean as select * from classicmodels.customers;

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
122 rows affected.

[]

In [59]:
%sql select customerNumber, customerName, country from classicmodels.customers_clean limit 10;

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
10 rows affected.

[(103, 'Atelier graphique', 'France'),
 (112, 'Signal Gift Stores', 'USA'),
 (114, 'Australian Collectors, Co.', 'Australia'),
 (119, 'La Rochelle Gifts', 'France'),
 (121, 'Baane Mini Imports', 'Norway'),
 (124, 'Mini Gifts Distributors Ltd.', 'USA'),
 (125, 'Havel & Zbyszek Co', 'Poland'),
 (128, 'Blauer See Auto, Co.', 'Germany'),
 (129, 'Mini Wheels Co.', 'USA'),
 (131, 'Land of Toys Inc.', 'USA')]

- You must produce a table that looks like the following, and implements referential integrity.

In [73]:
%sql select * from customers_clean limit 10;

10 rows affected.

[(103, 'Atelier graphique', 'Schmitt', 'Carine ', '40.32.2555', '54, rue Royale', None, 'Nantes', None, '44000', 1370, Decimal('21000.00'), 'FR'),
 (112, 'Signal Gift Stores', 'King', 'Jean', '7025551838', '8489 Strong St.', None, 'Las Vegas', 'NV', '83030', 1166, Decimal('71800.00'), 'US'),
 (114, 'Australian Collectors, Co.', 'Ferguson', 'Peter', '03 9520 4555', '636 St Kilda Road', 'Level 3', 'Melbourne', 'Victoria', '3004', 1611, Decimal('117300.00'), 'AU'),
 (119, 'La Rochelle Gifts', 'Labrune', 'Janine ', '40.67.8555', '67, rue des Cinquante Otages', None, 'Nantes', None, '44000', 1370, Decimal('118200.00'), 'FR'),
 (121, 'Baane Mini Imports', 'Bergulfsen', 'Jonas ', '07-98 9555', 'Erling Skakkes gate 78', None, 'Stavern', None, '4110', 1504, Decimal('81700.00'), 'NO'),
 (124, 'Mini Gifts Distributors Ltd.', 'Nelson', 'Susan', '4155551450', '5677 Strong St.', None, 'San Rafael', 'CA', '97562', 1165, Decimal('210500.00'), 'US'),
 (125, 'Havel & Zbyszek Co', 'Piestrzeniewicz', 'Zbyszek ', '(26) 642-7555', 'ul. Filtrowa 68', None, 'Warszawa', None, '01-012', None, Decimal('0.00'), 'PL'),
 (128, 'Blauer See Auto, Co.', 'Keitel', 'Roland', '+49 69 66 90 2555', 'Lyonerstr. 34', None, 'Frankfurt', None, '60528', 1504, Decimal('59700.00'), 'DE'),
 (129, 'Mini Wheels Co.', 'Murphy', 'Julie', '6505555787', '5557 North Pendale Street', None, 'San Francisco', 'CA', '94217', 1165, Decimal('64600.00'), 'US'),
 (131, 'Land of Toys Inc.', 'Lee', 'Kwai', '2125557818', '897 Long Airport Avenue', None, 'NYC', 'NY', '10022', 1323, Decimal('114900.00'), 'US')]

In [75]:
try:
    %sql update customers_clean set country_code = 'XX' where customerNumber=103
    print("Getting here is bad.")
except Exception as e:
    print("This is OK, e = ", e)

This is OK, e =  (pymysql.err.IntegrityError) (1452, 'Cannot add or update a child row: a foreign key constraint fails (`classicmodels`.`customers_clean`, CONSTRAINT `cc` FOREIGN KEY (`country_code`) REFERENCES `country_codes` (`code`))')
[SQL: update customers_clean set country_code = 'XX' where customerNumber=103]
(Background on this error at: http://sqlalche.me/e/gkpj)

This one is really unpleasant!

<u>Answer</u>

- This one is really unpleasant.


- The character sets might be a problem.

```





```
<b>My Answer</b> is below, please run cells one by one

Add a new column `country_code`

In [60]:
%%sql 
USE classicmodels;
ALTER TABLE customers_clean
ADD country_code varchar(4);

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
0 rows affected.
0 rows affected.

[]

In [61]:
%%sql
ALTER TABLE countrycodes
MODIFY COLUMN Code Varchar(4) NOT NULL;
ALTER TABLE countrycodes
ADD PRIMARY KEY (Code);

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
249 rows affected.
0 rows affected.

[]

Manually adjust some entries so they can match countrycodes

In [62]:
%%sql 
UPDATE customers_clean
SET country = "United States" 
WHERE country = "USA" OR country = "US" OR country = "United States of America";
UPDATE customers_clean
SET country = "United Kingdom" 
WHERE country = "UK";
UPDATE customers_clean
SET country = "Russian Federation" 
WHERE country = "Russia";

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
36 rows affected.
5 rows affected.
1 rows affected.

[]

In [63]:
%%sql
UPDATE customers_clean AS t1
SET country_code = (
    SELECT Code FROM countrycodes AS t2
    WHERE t1.Country = t2.Name
    LIMIT 1
);

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
122 rows affected.

[]

Drop the unnecessary column country

In [64]:
%%sql
ALTER TABLE customers_clean
DROP COLUMN country;

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
0 rows affected.

[]

In [65]:
%sql select * from customers_clean limit 10;

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
10 rows affected.

[(103, 'Atelier graphique', 'Schmitt', 'Carine ', '40.32.2555', '54, rue Royale', None, 'Nantes', None, '44000', 1370, Decimal('21000.00'), 'FR'),
 (112, 'Signal Gift Stores', 'King', 'Jean', '7025551838', '8489 Strong St.', None, 'Las Vegas', 'NV', '83030', 1166, Decimal('71800.00'), 'US'),
 (114, 'Australian Collectors, Co.', 'Ferguson', 'Peter', '03 9520 4555', '636 St Kilda Road', 'Level 3', 'Melbourne', 'Victoria', '3004', 1611, Decimal('117300.00'), 'AU'),
 (119, 'La Rochelle Gifts', 'Labrune', 'Janine ', '40.67.8555', '67, rue des Cinquante Otages', None, 'Nantes', None, '44000', 1370, Decimal('118200.00'), 'FR'),
 (121, 'Baane Mini Imports', 'Bergulfsen', 'Jonas ', '07-98 9555', 'Erling Skakkes gate 78', None, 'Stavern', None, '4110', 1504, Decimal('81700.00'), 'NO'),
 (124, 'Mini Gifts Distributors Ltd.', 'Nelson', 'Susan', '4155551450', '5677 Strong St.', None, 'San Rafael', 'CA', '97562', 1165, Decimal('210500.00'), 'US'),
 (125, 'Havel & Zbyszek Co', 'Piestrzeniewicz', 'Zbyszek ', '(26) 642-7555', 'ul. Filtrowa 68', None, 'Warszawa', None, '01-012', None, Decimal('0.00'), 'PL'),
 (128, 'Blauer See Auto, Co.', 'Keitel', 'Roland', '+49 69 66 90 2555', 'Lyonerstr. 34', None, 'Frankfurt', None, '60528', 1504, Decimal('59700.00'), 'DE'),
 (129, 'Mini Wheels Co.', 'Murphy', 'Julie', '6505555787', '5557 North Pendale Street', None, 'San Francisco', 'CA', '94217', 1165, Decimal('64600.00'), 'US'),
 (131, 'Land of Toys Inc.', 'Lee', 'Kwai', '2125557818', '897 Long Airport Avenue', None, 'NYC', 'NY', '10022', 1323, Decimal('114900.00'), 'US')]

Add integrity constraints

In [66]:
%%sql
ALTER TABLE customers_clean
ADD CONSTRAINT `cc` FOREIGN KEY (country_code) REFERENCES countrycodes(Code);

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
122 rows affected.

[]

In [67]:
try:
    %sql update customers_clean set country_code = 'XX' where customerNumber=103
    print("Getting here is bad.")
except Exception as e:
    print("This is OK, e = ", e)

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
This is OK, e =  (pymysql.err.IntegrityError) (1452, 'Cannot add or update a child row: a foreign key constraint fails (`classicmodels`.`customers_clean`, CONSTRAINT `cc` FOREIGN KEY (`country_code`) REFERENCES `countrycodes` (`Code`))')
[SQL: update customers_clean set country_code = 'XX' where customerNumber=103]
(Background on this error at: http://sqlalche.me/e/gkpj)

## E-R Diagrams (5 points)

- __Note:__ Please use Crow's Foot notation for this diagram.


- The model has the following entity types:
    - Student(uni, last_name, first_name)
    - Course(course_id, course_name)
    - Section(section_number, semester, year, course_id)
    
    
- Draw a logical ER diagram representing the data model. You do not have to worry about column types.


- The model MUST represent student enrollments.


- You may need to create an additional table.

<u>Answer</u>

<hr style="height:2px;">
<br><br>
<img src="./ER.PNG">
<br><br>
<hr style="height:2px;">

## Inheritance and Stored Procedures (10 points)

- The two following table definitions are a simple model for people at a university.

```
CREATE TABLE `student` (
  `uni` varchar(12) NOT NULL,
  `last_name` varchar(64) NOT NULL,
  `first_name` varchar(64) NOT NULL,
  `graduation_year` year(4) NOT NULL,
  PRIMARY KEY (`student`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;


CREATE TABLE `faculty` (
  `uni` varchar(12) NOT NULL,
  `last_name` varchar(64) NOT NULL,
  `first_name` varchar(64) NOT NULL,
  `title` enum('Professor','Assistant Professor','Associate Professor','Adjunct Professor') NOT NULL,
  PRIMARY KEY (`uni`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

```

- Implement a view ```People``` that supports ```SELECT``` for the following columns:
    - UNI
    - last_name
    - first_name
    - Type is 'S' if the person is a student and 'F' if the person is a faculty.
    - 'NA' for graduation year if the person is not a student.
    - 'NA' for title if the person is not a faculty.
    
    
- Write a stored procedure that:
    - Inserts the data in the proper table based on the type.
    - Generates a unique UNI for a newly inserted person.
    
    
- You do not need to worry about error checking parameters, types, etc.
    
    
<u>Answer</u>

```


```

People View:
```sql
CREATE VIEW People(uni, last_name, first_name, `type`, graduation_year, title) AS
SELECT uni, last_name, first_name, 'S', graduation_year, "NA"
FROM student
UNION
SELECT uni, last_name, first_name, 'F', "NA", title
FROM faculty
```

Generate UNI function:
```sql
CREATE DEFINER=`dbuser`@`localhost` FUNCTION `generate_uni`(
first_name varchar(32), last_name varchar(32)) RETURNS varchar(12) CHARSET utf8 DETERMINISTIC
BEGIN

	declare f_prefix varchar(2);
    declare l_prefix varchar(2);
    declare prefix_count int;
    declare full_prefix varchar(5);
    declare result varchar(12);
    
    
    set f_prefix = lower(substr(first_name, 1, 2));
    set l_prefix = lower(substr(last_name, 1, 2));
    
    set full_prefix = concat(f_prefix, l_prefix, '%');
    
    set prefix_count = (select count(*) as count from people where uni like(full_prefix));
    
    set result = concat(f_prefix, l_prefix, prefix_count+1);
    
    return result;
    
END
```
Stored Procedure:
```sql
CREATE DEFINER=`dbuser`@`localhost` PROCEDURE `insert_people`(
	in l_name varchar(32), in f_name varchar(32), in `type` ENUM('S', 'F'), in g_year year(4), 
    in title enum('Professor','Assistant Professor','Associate Professor','Adjunct Professor'))
BEGIN
	DECLARE new_uni varchar(12);
    
    SET new_uni = generate_uni(f_name, l_name);
    
    IF `type` = 'F' THEN
		INSERT INTO faculty (uni, last_name, first_name, title)
        VALUES (new_uni, l_name, f_name, title);
	ELSE
		INSERT INTO student (uni, last_name, first_name, graduation_year)
        VALUES (new_uni, l_name, f_name, g_year);
    END IF;
END
```

## Putting Some Pieces Together (5 points)

- The following is the current definition for ```lahman2019.salaries.```

```
CREATE TABLE `salaries` (
  `yearID` text,
  `teamID` text,
  `lgID` text,
  `playerID` text,
  `salary` text
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

```

- Create a copy of the data into ```salaries_clean.```


- Transform the definition to improve integrity, making whatever changes you think necessary. The changes will require modifying column types, check constraints/triggers to ensure values are valid, and foreign key constraints.


<u>Answer</u>

The resulting table should look like
```sql
CREATE TABLE `salaries` (
  `yearID` varchar(4) NOT NULL,
  `teamID` varchar(4) NOT NULL,
  `lgID` varchar(4) NOT NULL,
  `playerID` varchar(12) NOT NULL,
  `salary` text DEFAULT NULL,
  PRIMARY KEY (`playerID`,`teamID`,`yearID`,`lgID`),
  CONSTRAINT `sa_to_p` FOREIGN KEY (`playerID`) REFERENCES `people` (`playerID`),
  CONSTRAINT `sa_to_t` FOREIGN KEY (`teamID`, `yearID`) REFERENCES `teams` (`teamID`, `yearID`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
```
The length yearID, teamID, playerID is inferred from other tables and verified with queries, the length of lgID is inferred with queries. Following is the query I used to find the length.
```sql
SELECT MAX(length([id])) FROM lahman2019clean.salaries
```
yearID: 4, teamID: 3, playerID: 9, lgID: 2\
I simply chose a length that is sufficient for those columns.\
I left salary as `text` to be consistent with other tables (they treat numbers as text).

In [144]:
%%sql
USE lahman2019clean;
CREATE TABLE `salaries_clean` (
  `yearID` varchar(4) NOT NULL,
  `teamID` varchar(4) NOT NULL,
  `lgID` varchar(4) NOT NULL,
  `playerID` varchar(12) NOT NULL,
  `salary` text DEFAULT NULL,
  PRIMARY KEY (`playerID`,`teamID`,`yearID`,`lgID`),
  CONSTRAINT `sa_to_p` FOREIGN KEY (`playerID`) REFERENCES `people` (`playerID`),
  CONSTRAINT `sa_to_t` FOREIGN KEY (`teamID`, `yearID`) REFERENCES `teams` (`teamID`, `yearID`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci
AS SELECT * FROM salaries;

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
0 rows affected.
26428 rows affected.

[]

## Graph Data $-$ Game of Thrones

- The GitHub repository https://github.com/melaniewalsh/sample-social-network-datasets/tree/master/sample-datasets/game-of-thrones contains data for a graph of relationships between characters in _Game of Thrones._
    - The file _got-nodes.csv_ contains simple information about characters.
    - The file _got-edges.csv_ contains information about relationships between characters.
    
    
- The [README](https://github.com/melaniewalsh/sample-social-network-datasets/blob/master/sample-datasets/game-of-thrones/README.md) explains the meaning of the files and fields.


- Load the data:
    - Create a new database _W4111Midterm_ in your MySQL instance.
    - Use the Table Data import tool to load the CSV files into tables named:
        - _got_nodes_
        - _got_edges_
        

- After loading, your sample data should look like the examples below.

In [78]:
%sql select * from W4111Midterm.got_nodes limit 10;

10 rows affected.

[('Aegon', 'Aegon'),
 ('Aemon', 'Aemon'),
 ('Aerys', 'Aerys'),
 ('Alliser', 'Alliser'),
 ('Amory', 'Amory'),
 ('Anguy', 'Anguy'),
 ('Arya', 'Arya'),
 ('Balon', 'Balon'),
 ('Barristan', 'Barristan'),
 ('Belwas', 'Belwas')]

In [79]:
%sql select * from W4111Midterm.got_edges limit 10;

10 rows affected.

[('Aemon', 'Grenn', 5),
 ('Aemon', 'Samwell', 31),
 ('Aerys', 'Jaime', 18),
 ('Aerys', 'Robert', 6),
 ('Aerys', 'Tyrion', 5),
 ('Aerys', 'Tywin', 8),
 ('Alliser', 'Mance', 5),
 ('Amory', 'Oberyn', 5),
 ('Arya', 'Anguy', 11),
 ('Arya', 'Beric', 23)]

- Wanted to know the shortest path in the data between two obscure characters: Roose, Craster.


- So, I asked my wizard friend.

| <img src="./wizard_graph.png"> |
| :---: |
| __Advanced Magic__ |


- I did not understand the spell. I have been teaching SQL. 


- But, I know giant class of wizards comfortable with SQL magic. So, I decided to ask them to show me the spell.

- So, the exam question is, "Show me an SQL spell that returns the information."


- There is a spell that is a single SQL statement, but the aliasing will drive you nuts.


- You may create tables that compute partial results.

<u>Answer</u>

Naively, this problem can be solved with a breath first search on the graph.
I simulated BFS by repeatedly performing self join on got_edge and continue working on those result with connected path, until there is a connected undirected path between Roose and Craster.

In [186]:
%%sql
USE W4111Midterm

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
0 rows affected.

[]

Because the graph is undirected, the revesed target-source pair should also be considered

In [196]:
%%sql
CREATE TABLE got_edges_undirected AS
(
    SELECT `Source`, Target FROM got_edges
    UNION
    SELECT Target AS `Source`, `Source` AS Target FROM got_edges
)

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
704 rows affected.

[]

In [200]:
%%sql
CREATE TABLE one_step AS
SELECT t1.`Source` AS one_source, t1.Target AS one_target, t2.`Source` AS two_source, t2.Target AS two_target
FROM got_edges_undirected t1, got_edges_undirected t2
WHERE t1.Target = t2.`Source`

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
9266 rows affected.

[]

In [204]:
%%sql
SELECT * FROM one_step
WHERE 
    (one_source = "Roose" AND two_target = "Craster") OR
    (one_source = "Craster" AND two_target = "Roose")

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
0 rows affected.

[]

No result yet at step 2, continue

In [205]:
%%sql
CREATE TABLE two_step AS
SELECT t1.one_source AS one_source, t1.one_target AS one_target, 
t1.two_source AS two_source, t1.two_target AS two_target,
t2.`Source` AS three_source, t2.Target AS three_target
FROM one_step t1, got_edges_undirected t2
WHERE t1.two_target = t2.`Source`

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
113844 rows affected.

[]

In [206]:
%%sql
SELECT * FROM two_step
WHERE 
    (one_source = "Roose" AND three_target = "Craster") OR
    (one_source = "Craster" AND three_target = "Roose")

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
4 rows affected.

[('Roose', 'Arya', 'Arya', 'Jon', 'Jon', 'Craster'),
 ('Roose', 'Robb', 'Robb', 'Jon', 'Jon', 'Craster'),
 ('Craster', 'Jon', 'Jon', 'Arya', 'Arya', 'Roose'),
 ('Craster', 'Jon', 'Jon', 'Robb', 'Robb', 'Roose')]

Roose-Arya-Jon-Craster\
Roose-Robb-Jon-Craster\
Craster-Jon-Arya-Roose\
Craster-Jon-Robb-Roose

4 path found, length 3

4 rows affected.

[('Craster', 'Jon', 'Jon', 'Arya', 'Arya', 'Roose'),
 ('Roose', 'Arya', 'Arya', 'Jon', 'Jon', 'Craster'),
 ('Roose', 'Robb', 'Robb', 'Jon', 'Jon', 'Craster'),
 ('Craster', 'Jon', 'Jon', 'Robb', 'Robb', 'Roose')]